trade_exp/src/Documents/РегистрацияУдержаний/РегистрацияУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="59b18004-526e-42f2-a879-72858780878a">
  <name>РегистрацияУдержаний</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0cfc5d87-500b-47c4-bc59-53e1f62368fa">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fa3fbacb-3f1e-4fb7-b7ae-8ef80d773bf4">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d8516c59-315b-4b9f-aa93-7d7f7472f1fb">
    <name>Удержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4c2d274-c78b-4c31-a9ea-5ec768ec53e7">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f78748e-a24a-4291-b85b-115ad1dd442e">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="12681a44-9b3b-44bc-af62-992f9b154aa4">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07b16de5-ff78-4fce-8c6b-432442e61754">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a877f0ad-1234-4b6a-8977-4819fbfd91e1">
    <name>Периодический</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07024e26-fdc4-4544-a13a-48e5e48be1d8">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d8042146-aa03-491f-a1b0-5bd276cbf8a9">
    <name>СуммаУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0035154f-665a-437c-83af-0b5c47eccaf8">
    <name>Закрыл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/InformationRegisters/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2d53e5c9-911b-4810-b8d1-7e5cf4d442c8">
  <name>Удержания</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="6cbacd10-1223-48c2-8695-eb624272b705">
    <name>СуммаУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="d41a7967-81fb-464b-87dc-fad4c0eb575f">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="441ad33d-ec2b-442a-b6f1-d2f8f9571a10">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a571e0c2-1cdc-4e8c-b3f4-d6f22838e55c">
    <name>Удержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="063b3a13-df87-44be-976e-25da34f40d6e">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c5dca119-88ef-4e61-b6e5-3917fe28b599">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bc62299-cfbd-4b49-b31c-5a1e0e83824d">
    <name>Периодический</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e2b90059-59db-43b4-8a12-ae8522d97ffd">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4246bf06-45ee-4f7b-9f7d-37cc4e74a99b">
    <name>Проблема</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/РегистрацияУдержаний/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Удержания
	Движения.Удержания.Записывать = Истина;
	Движение = Движения.Удержания.Добавить();
	Движение.Организация = Организация;
	Движение.Сотрудник = Сотрудник;
	Движение.Удержание = Удержание;
	Движение.Проблема = Неопределено;
	Движение.ДатаНачалаДействия = ДатаНачалаДействия;
	Движение.ДатаОкончанияДействия = ДатаОкончанияДействия;
	Движение.Периодический = Периодический;
	Движение.Закрыт = Закрыт;
	Движение.СуммаУдержания = СуммаУдержания;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецЕсли
